#!/usr/bin/env python
#-*- coding:utf-8 -*-
# Author:summer_han

shopList1 = '''
--------------物品分类----------------
1、electronic product（电子产品）
2、drink (饮品）
3、household appliances（家用电器）
'''
###################### 电子产品 信息 和 价格字典 #############################
listInfo = [None,'L1_Info','L2_Info','L3_Info']

L1_Info = '''
---------电子产品列表-----------
1、samsung S9  -----  6999.0
2、xiao mi 2s  -----  2599.0
3、huawei p20  -----  5999.0

'''
# L1_Info_Dic = {
#     '1':'6999.0',
#     '2':'2599.0',
#     '3':'5999.0'
# }
L1_Info_Dic = {
    '1':['samsung S9','6999.0'],
    '2':['xiao mi 2s','2599.0'],
    '3':['huawei p20','5999.0']
}
###################### 饮品 信息 和 价格字典 #############################
L2_Info = '''
---------饮品列表-----------
1、coffee   -----  38.0
2、milk     -----  4.5
3、beer     -----  5.0

'''
L2_Info_Dic = {
    '1':['coffee','38.0'],
    '2':['milk','4.5'],
    '3':['beer','5.0']
}
###################### 家用电器 信息 和 价格字典 #############################
L3_Info = '''
---------家用电器列表-----------
1、TCL TV         -----  4999.0
2、Ice Box        -----  10999.0
3、Washin Machine -----  3899.0

'''
L3_Info_Dic = {
    '1':['TCL TV','4999.0'],
    '2':['Ice Box','10999.0'],
    '3':['Washin Machine','3899.0']
}
